Rails/blog/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "qqqqqqqqqqqqqq"], ["text", "q"], ["created_at", "2021-10-16 21:27:03.724105"], ["updated_at", "2021-10-16 21:27:03.724105"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "text" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "second "], ["text", "swwwwwwwwwwwwwaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"], ["updated_at", "2021-10-18 21:50:40.244263"], ["id", 16]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)