Rails/scheduled_tweets/app/controllers/main_controller.rb

    def index
        if session[:user_id]
            @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]