Rails/scheduled_tweets/app/controllers/tweets_controller.rb

    def create
        @tweet = Current.user.tweets.new(tweet_params)
        if @tweet.save
---
INSERT INTO "tweets" ("user_id", "twitter_account_id", "body", "publish_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 10], ["twitter_account_id", 5], ["body", "test"], ["publish_at", "2022-05-11 19:55:00"], ["created_at", "2022-05-10 19:55:59.276489"], ["updated_at", "2022-05-10 19:55:59.276489"]]