Rails/scheduled_tweets/app/controllers/twitter_accounts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "twitter_accounts".* FROM "twitter_accounts" WHERE "twitter_accounts"."user_id" = ? AND "twitter_accounts"."id" = ? LIMIT ?  [["user_id", 9], ["id", 2], ["LIMIT", 1]]
DELETE FROM "twitter_accounts" WHERE "twitter_accounts"."id" = ?  [["id", 2]]
---
    def destroy
        @twitter_account = Current.user.twitter_accounts.find(params[:id])
        @twitter_account.destroy