Rails/nps/app/controllers/ratings_controller.rb

  def destroy
    @rating.destroy
---
DELETE FROM "ratings" WHERE "ratings"."id" = ?  [["id", 980190962]]

    def set_rating
      @rating = Rating.find(params[:id])
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]