Rails/twittter/app/controllers/tweeets_controller.rb

SELECT "tweeets".* FROM "tweeets" ORDER BY created_at DESC
---
  def index
    @tweeets = Tweeet.all.order("created_at DESC")

INSERT INTO "tweeets" ("tweeet", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tweeet", "first bEEEEEEEEEEEEb"], ["created_at", "2021-10-10 22:26:34.230515"], ["updated_at", "2021-10-10 22:26:34.230515"], ["user_id", 1]]
---
  def create
    @tweeet = current_user.tweeets.build(tweeet_params)

    respond_to do |format|
      if @tweeet.save

UPDATE "tweeets" SET "tweeet" = $1, "updated_at" = $2 WHERE "tweeets"."id" = $3  [["tweeet", "brbrbrbrbbrrbb"], ["updated_at", "2021-10-11 00:13:55.747162"], ["id", 26]]
---
  def update
    respond_to do |format|
      if @tweeet.update(tweeet_params)

DELETE FROM "tweeets" WHERE "tweeets"."id" = $1  [["id", 1]]
---
  def destroy
    @tweeet.destroy

SELECT "tweeets".* FROM "tweeets" WHERE "tweeets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_tweeet
      @tweeet = Tweeet.find(params[:id])