Rails/scheduled_tweets/app/models/tweet.rb

  def publish_to_twitter!
    tweet = twitter_account.client.update(body)
---
UPDATE "tweets" SET "tweet_id" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["tweet_id", "1524439191546904581"], ["updated_at", "2022-05-11 17:20:00.894503"], ["id", 8]]