Rails/websock/app/controllers/hangouts_controller.rb

SELECT "messages".* FROM "messages"
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 2]]
---
  def index
     @message = Message.new
     @messages = Message.includes(:user)