Rails/websock/app/controllers/messages_controller.rb

INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["body", "hello"], ["user_id", 1], ["created_at", "2023-12-30 16:00:17.262261"], ["updated_at", "2023-12-30 16:00:17.262261"]]
---
  def create
    @message = current_user.messages.build(message_params)
    @message.save